EDT/КассовыйСервер/src/Documents/ксЧекККМ/ксЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ксЧекККМ</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧекКПечати</name>
    <type>
      <types>DocumentRef.ксЧекКПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ксОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДСПоДоставке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ксТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЧека</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФН</name>
    <type>
      <types>CatalogRef.ксФискальныеНакопители</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ксКассиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассовогоЧека</name>
    <type>
      <types>EnumRef.ксТипыКассовыхЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПоставщикаДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ксНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.ксПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ИННПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>КодНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/КассовыйСервер/src/Enums/ВерсииФФД/ВерсииФФД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВерсииФФД</name>
  <enumValues>
    <name>Версия_1_0</name>
  </enumValues>
  <enumValues>
    <name>Версия_1_0_5</name>
  </enumValues>
  <enumValues>
    <name>Версия_1_2</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Enums/ксТипыСобытийУведомления/ксТипыСобытийУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксТипыСобытийУведомления</name>
  <enumValues>
    <name>ОшибкаПодключенияКККМ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПечатиЧека</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаККМ</name>
  </enumValues>
  <enumValues>
    <name>НетДоступныхККМПоОрганизации</name>
  </enumValues>
  <enumValues>
    <name>НеСоздалисьЧекиККМ</name>
  </enumValues>
  <enumValues>
    <name>ККМНедоступнаПродолжительноеВремя</name>
  </enumValues>
  <enumValues>
    <name>РегламентПроверкиНепробитыхЧеков</name>
  </enumValues>
  <enumValues>
    <name>НеУказанКассир</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОткрытияСмены</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Enums/ксТипыКассовыхЧеков/ксТипыКассовыхЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксТипыКассовыхЧеков</name>
  <enumValues>
    <name>ЧекПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекВозвратаРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаПрихода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррецииРасхода</name>
  </enumValues>
  <enumValues>
    <name>ЧекКоррекцииВозвратаРасхода</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Catalogs/ксТипыОплат/ксТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ксТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/КассовыйСервер/src/Documents/ксЧекККМ/ObjectModule.bsl
Функция ПровестиИНапечататьЧек(СерверККМ) Экспорт
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Результат", Истина);
	СтрукОтвета.Вставить("ОписаниеОшибки", "");
	
	Если Не ЧекНапечатан Тогда
		СтрукПараметровЧека = Новый Структура;
		//товары чека
		ЗапТоваров = Новый Запрос;
		ЗапТоваров.Текст = "ВЫБРАТЬ
		                   |	ксЧекККМТовары.Номенклатура.Наименование КАК Наименование,
						   |	ксЧекККМТовары.Номенклатура.Ссылка Как Товар,
		                   |	ксЧекККМТовары.Цена КАК Цена,
		                   |	ксЧекККМТовары.Количество КАК Количество,
		                   |	1 КАК НомерСекции,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0)
		                   |				ИЛИ ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.пустаяСсылка)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |						ТОГДА 4
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |						ТОГДА 1
		                   |				КОНЕЦ
		                   |		КОГДА ксЧекККМТовары.Ссылка.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0_5)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |						ТОГДА 5
		                   |				КОНЕЦ
		                   |		ИНАЧЕ 3
		                   |	КОНЕЦ КАК СтавкаНДС,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -1
		                   |			ТОГДА 0
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 18 / 118
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 10
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 10 / 110
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 18
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 18 / 118
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 20
		                   |			ТОГДА ксЧекККМТовары.Цена * ксЧекККМТовары.Количество * 20 / 120
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = 0
		                   |			ТОГДА 0
		                   |	КОНЕЦ КАК СуммаНалога,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.СтавкаНДС = -2
		                   |				ИЛИ ксЧекККМТовары.СтавкаНДС = 18
		                   |			ТОГДА 20
		                   |		ИНАЧЕ ксЧекККМТовары.СтавкаНДС
		                   |	КОНЕЦ КАК КодНалога,
		                   |	ксЧекККМТовары.КодМаркировки КАК КодМаркировки,
		                   |	ВЫБОР
		                   |		КОГДА ЕСТЬNULL(ксЧекККМТовары.Поставщик.ИНН, ИСТИНА) = ИСТИНА
		                   |			ТОГДА ксЧекККМТовары.ИННПоставщика
		                   |		ИНАЧЕ ксЧекККМТовары.Поставщик.ИНН
		                   |	КОНЕЦ КАК ПоставщикИНН,
		                   |	ксЧекККМТовары.Поставщик.Телефон КАК ПоставщикТелефон,
		                   |	ксЧекККМТовары.Поставщик.Наименование КАК ПоставщикНаименование,
		                   |	ксЧекККМТовары.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМТовары.Ссылка.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ксТипыОплат.ОплаченоВМагазине)
						   //|				ИЛИ ксЧекККМТовары.Ссылка.СуммаПредоплаты <> 0
		                   |			ТОГДА 1
		                   |		ИНАЧЕ 4
		                   |	КОНЕЦ КАК ПризнакСпособаРасчета
		                   |ИЗ
		                   |	Документ.ксЧекККМ.Товары КАК ксЧекККМТовары
		                   |ГДЕ
		                   |	ксЧекККМТовары.Ссылка.Ссылка = &Чек
		                   |
		                   |ОБЪЕДИНИТЬ ВСЕ
		                   |
		                   |ВЫБРАТЬ
		                   |	""Доставка"",
						   |	"""",
		                   |	ксЧекККМ.СтоимостьДоставки,
		                   |	1,
		                   |	1,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0)
		                   |				ИЛИ ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.пустаяСсылка)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |						ТОГДА 4
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |						ТОГДА 1
		                   |				КОНЕЦ
		                   |		КОГДА ксЧекККМ.КассаККМ.ВерсияФФД = ЗНАЧЕНИЕ(Перечисление.ВерсииФФД.Версия_1_0_5)
		                   |			ТОГДА ВЫБОР
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |						ТОГДА 6
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |						ТОГДА 5
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |						ТОГДА 3
		                   |					КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |						ТОГДА 5
		                   |				КОНЕЦ
		                   |		ИНАЧЕ 3
		                   |	КОНЕЦ,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -1
		                   |			ТОГДА 0
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 18 / 118
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 10
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 10 / 110
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 18 / 118
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 20
		                   |			ТОГДА ксЧекККМ.СтоимостьДоставки * 20 / 120
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = 0
		                   |			ТОГДА 0
		                   |	КОНЕЦ,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.СтавкаНДСПоДоставке = -2
		                   |				ИЛИ ксЧекККМ.СтавкаНДСПоДоставке = 18
		                   |			ТОГДА 20
		                   |		ИНАЧЕ ксЧекККМ.СтавкаНДСПоДоставке
		                   |	КОНЕЦ,
		                   |	"""",
		                   |	ксЧекККМ.ИННПоставщикаДоставки,
		                   |	"""",
		                   |	"""",
		                   |	4,
		                   |	ВЫБОР
		                   |		КОГДА ксЧекККМ.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ксТипыОплат.ОплаченоВМагазине)
		                  // |				ИЛИ ксЧекККМ.СуммаПредоплаты <> 0
		                   |			ТОГДА 1
		                   |		ИНАЧЕ 4
		                   |	КОНЕЦ
		                   |ИЗ
		                   |	Документ.ксЧекККМ КАК ксЧекККМ
		                   |ГДЕ
		                   |	ксЧекККМ.Ссылка = &Чек
		                   |	И ксЧекККМ.СтоимостьДоставки <> 0";
		ЗапТоваров.УстановитьПараметр("Чек", Ссылка);
		
		ТабТоваров = ЗапТоваров.Выполнить().Выгрузить();
		
		Для Каждого Тек Из ТабТоваров Цикл
			Тек.Наименование = СтрЗаменить(Тек.Наименование, "«", "");
		КонецЦикла;	
		
		//доп свойства чека
		ЗапДопПараметрыЧека = Новый Запрос;
		ЗапДопПараметрыЧека.Текст = "ВЫБРАТЬ
		                            |	ксЧекККМ.Ссылка КАК ДокументЧек,
		                            |	ксЧекККМ.ПометкаУдаления КАК ПометкаУдаления,
		                            |	ксЧекККМ.Номер КАК Номер,
		                            |	ксЧекККМ.Дата КАК Дата,
		                            |	ксЧекККМ.Проведен КАК Проведен,
		                            |	ксЧекККМ.Заказ КАК Заказ,
		                            |	ксЧекККМ.Организация КАК Организация,
		                            |	ксЧекККМ.КассаККМ КАК КассаККМ,
		                            |	ксЧекККМ.СтоимостьДоставки КАК СтоимостьДоставки,
		                            |	ксЧекККМ.СтавкаНДСПоДоставке КАК СтавкаНДСПоДоставке,
		                            |	ксЧекККМ.ТипОплаты КАК ТипОплаты,
		                            |	ксЧекККМ.СуммаДокумента КАК СуммаДокумента,
		                            |	ксЧекККМ.ДатаЧека КАК ДатаЧека,
		                            |	ксЧекККМ.СуммаЧека КАК СуммаЧека,
		                            |	ксЧекККМ.ТипЧека КАК ТипЧека,
		                            |	ксЧекККМ.ФД КАК ФД,
		                            |	ксЧекККМ.ФПД КАК ФПД,
		                            |	ксЧекККМ.НомерДокумента КАК НомерДокумента,
		                            |	ксЧекККМ.ФН КАК ФН,
		                            |	ксЧекККМ.НомерЧека КАК НомерЧека,
		                            |	ксЧекККМ.НомерСмены КАК НомерСмены,
		                            |	ксЧекККМ.ЧекКПечати.АдресИнформирования КАК АдресИнформирования,
		                            |	ксЧекККМ.ТипОплаты.КодОплатыНаККМ КАК КодТипаОплатыНаККМ,
		                            |	ксЧекККМ.Кассир.Наименование КАК Кассир,
		                            |	ксЧекККМ.КассаККМ.ВерсияФФД КАК ВерсияФФД,
		                            |	ксЧекККМ.СуммаПредоплаты КАК СуммаПредоплаты,
		                            |	ксЧекККМ.ЧекКПечати.ВнешнийНомерЗаказа КАК НомерВнешнегоЗаказа
		                            |ИЗ
		                            |	Документ.ксЧекККМ КАК ксЧекККМ
		                            |ГДЕ
		                            |	ксЧекККМ.Ссылка = &Чек";
		ЗапДопПараметрыЧека.УстановитьПараметр("Чек", Ссылка);
		РезДопПараметрыЧека = ЗапДопПараметрыЧека.Выполнить().Выбрать();
		РезДопПараметрыЧека.Следующий();
		ДопПараметрыЧека = Новый Структура;
		ДопПараметрыЧека.Вставить("АдресИнформирования");
		ДопПараметрыЧека.Вставить("КодТипаОплатыНаККМ");
		ДопПараметрыЧека.Вставить("Кассир");
		ДопПараметрыЧека.Вставить("ТипОплаты");
		ДопПараметрыЧека.Вставить("НомерВнешнегоЗаказа");
		ДопПараметрыЧека.Вставить("СуммаПредоплаты");
		ДопПараметрыЧека.Вставить("ДокументЧек");
		
		ЗаполнитьЗначенияСвойств(ДопПараметрыЧека, РезДопПараметрыЧека);
		Если Не ЗначениеЗаполнено(ДопПараметрыЧека.АдресИнформирования) Тогда
			//ДопПараметрыЧека.АдресИнформирования = "checks@strizh-logistic.ru";
			//ДопПараметрыЧека.АдресИнформирования = "couriers.service@checks.ru";
			ДопПараметрыЧека.АдресИнформирования = "checks@gl.ru";
		КонецеСли;	
		
		Если Не ЗначениеЗаполнено(ДопПараметрыЧека.Кассир) Тогда
			ДопПараметрыЧека.Кассир = "Кассир 1";
		КонецеСли;	
		
		
		//собственно, сама печать чека
		ЧекНапечатан = Ложь;
		Если Не ЗначениеЗаполнено(РезДопПараметрыЧека.ВерсияФФД) Или РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_0 Тогда
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧека(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);
		ИначеЕсли РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_0_5 Тогда	
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧекаФФД_1_05(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);
		ИначеЕсли РезДопПараметрыЧека.ВерсияФФД = Перечисления.ВерсииФФД.Версия_1_2 Тогда	
			РезультатПечати = ККМ_ФЗ_54СерверПереопределяемый.ПечатьЧекаФФД_1_2(СерверККМ, КассаККМ, ТабТоваров, СтрукПараметровЧека, ДопПараметрыЧека,, ТипКассовогоЧека);			
		КонецеСли;	
		
		Если Не РезультатПечати.Результат Тогда
			Попытка
				ККМ_ФЗ_54СерверПереопределяемый.ЗаписьЛогаОшибкиККМ(РезультатПечати.КодОшибки, РезультатПечати.ТекстОшибки, КассаККМ.ПроизводительККМ, Ссылка, РезультатПечати.ОписаниеОшибкиККМ);				
			Исключение
				Мас = ксРаботаСККМСервер.ВернутьМассивАдресов(Перечисления.ксТипыСобытийУведомления.ОшибкаПечатиЧека);
				ксРаботаСККМСервер.ОтправкаСистемногоСообщенияEMAIL(Мас, ОписаниеОшибки(), "Ошибка при фиксации ошибки");		
			КонецПопытки;	
			СтрукОтвета.Вставить("Результат", Ложь);
			СтрукОтвета.Вставить("ОписаниеОшибки", "Чек не напечатан!");
			Возврат СтрукОтвета;
		Иначе
			ЧекНапечатан = Истина;
		КонецеСли;
		
		
		ТабТоваров.Свернуть("КодНалога", "СуммаНалога");
		
		Налоги.Загрузить(ТабТоваров);
		Для Каждого Тек Из Налоги Цикл
			Тек.СуммаНалога = Окр(Тек.СуммаНалога, 2);
		КонецЦикла;	
		
		ФН = ККМ_ФЗ_54.ПолучитьФН(СтрукПараметровЧека.ФН);
		ДатаЧека = СтрукПараметровЧека.ДатаЧека;
		СуммаЧека = СтрукПараметровЧека.СуммаЧека;
		Если ТипКассовогоЧека = Перечисления.ксТипыКассовыхЧеков.ЧекПрихода Тогда
			ТипЧека = 1;
		ИначеЕсли ТипКассовогоЧека = Перечисления.ксТипыКассовыхЧеков.ЧекВозвратаПрихода Тогда
			ТипЧека = 2;
		Конецесли;
		//ТипЧека = СтрукПараметровЧека.ТипЧека;
		ФПД = СтрукПараметровЧека.ФПД;
		ФД = Формат(СтрукПараметровЧека.ФД, "ЧГ=");
		НомерДокумента = СтрукПараметровЧека.НомерДокумента;
		НомерЧека = СтрукПараметровЧека.НомерЧека;
		НомерСмены = СтрукПараметровЧека.НомерСмены;
		
		Записать(РежимЗаписиДокумента.Запись);
	КонецеСли;
	Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат СтрукОтвета;
КонецФункции
